import Card from "../Card/Card"

export default function PreviewServices() {
  return (
    <Card title="بیمه ها"
     titleCardOne="بیمه زندگی" 
      subTitleOne=
     "بیمه زندگی، قراردادی است که در آن بیمه‌گذار متعهد می‌شود به بیمه‌گر حق بیمه‌ای پرداخت کند و در عوض، در صورت فوت بیمه‌شده، مبلغ معینی به ذینفعان (مانند خانواده یا وابستگان) پرداخت می‌شود. "
    titleCardTwo="بیمه ثالث بدنه" 
    subTitleTwo= " بیمه ثالث بدنه، نوعی بیمه خودرو است که شامل دو بخش اصلی می‌شود: بیمه مسئولیت مدنی (ثالث) و بیمه بدنه. بیمه مسئولیت مدنی، خسارات مالی و جانی که ممکن است به دیگران وارد شود را پوشش می‌دهد"
    titleCardThree="بیمه درمان" 
    subTitleThree="
    بیمه درمان، پوشش مالی برای هزینه‌های پزشکی و درمانی افراد است. این نوع بیمه می‌تواند شامل هزینه‌های بیمارستان، دارو، آزمایشات و خدمات پزشکی دیگر باشد. 
    "
    gap="md:mb-20 mt-32 max-md:py-10"></Card>
  )
}