import Card from "../card/Card"

export default function PreviewCounseling() {
  return (
    <Card title="مشاوره ها"
     titleCardOne="مشاوره روانشناسی " 
      subTitleOne=
    "این نوع مشاوره به افراد کمک می‌کند تا با مشکلات روانی و عاطفی خود بهتر کنار بیایند. مشاوران روان‌شناسی می‌توانند در زمینه‌های مختلفی مانند اضطراب، افسردگی، روابط بین فردی و مدیریت استرس به مراجعان کمک کنند."
    titleCardTwo=" مشاوره سرمایه گذاری " 
    subTitleTwo= 
    "این نوع مشاوره به افراد و سازمان‌ها کمک می‌کند تا تصمیمات بهتری در زمینه سرمایه‌گذاری بگیرند. مشاوران سرمایه‌گذاری با تحلیل بازار، شناسایی فرصت‌ها و مدیریت ریسک‌ها به مراجعان کمک می‌کنند تا سرمایه‌گذاری‌های موفق‌تری داشته باشند."
    titleCardThree="مشاوره حقوقی" 
    subTitleThree=
    "مشاوره حقوقی شامل ارائه راهنمایی و اطلاعات در مورد مسائل حقوقی و قانونی است. وکلا و مشاوران حقوقی می‌توانند در زمینه‌های مختلفی مانند قراردادها، دعاوی، حقوق خانواده و موارد کیفری به افراد و سازمان‌ها کمک کنند."
    gap="md:mb-32 max-md:py-10"></Card>
  )
}
