import Card from "../card/Card"

export default function Blog() {
  return (
    <div className="overflow-hidden">
    <Card title="بلاگ" titleCardOne="چرا بیمه عمر ضروری است؟" subTitleOne="بیمه عمر نه‌تنها امنیت مالی را برای خانواده‌تان فراهم می‌کند، بلکه می‌تواند به عنوان یک سرمایه‌گذاری مطمئن نیز عمل کند. در این مقاله به مزایای بیمه عمر و ضرورت آن برای هر فرد می‌پردازیم"
    titleCardTwo="چگونه بیمه خودرو انتخاب کنیم؟" 
     subTitleTwo= " نتخاب بیمه خودرو ممکن است گاهی دشوار به نظر برسد. در این مقاله، نکات کلیدی برای انتخاب بیمه مناسب خودرو و عواملی که باید در نظر بگیرید را بررسی خواهیم کرد"
    titleCardThree="بیمه مسئولیت" subTitleThree="بیمه مسئولیت می‌تواند شما را در برابر دعاوی حقوقی و هزینه‌های ناشی از آسیب‌های احتمالی محافظت کند. در این مقاله به اهمیت بیمه مسئولیت و دلایل نیاز به آن می‌پردازیم"
    gap="py-20 xl:mt-10"></Card></div>
  )
}
