
import { useState } from 'react';

export default function Rules() {
    const [isScrollable, setIsScrollable] = useState(false);
    const [isChecked, setIsChecked] = useState(false);

    const handleScroll = (event) => {
        const { scrollTop, scrollHeight, clientHeight } = event.target;
        if (scrollTop + clientHeight >= scrollHeight) {
            setIsScrollable(true);
        } else {
            setIsScrollable(false); // Reset when not at the bottom
        }
    };

    const handleRadioChange = () => {
        setIsChecked(!isChecked);
        console.log(!isChecked);
    };

    return (
        <div className="absolute z-50 bg-[rgba(0,0,0,0.2)] w-full h-full flex items-center justify-center">
            <div className="lg:w-5/12 max-lg:w-7/12 max-md:w-10/12 bg-white rounded-xl lg:p-16 max-lg:p-10 h-4/6 flex flex-col">
                <div
                    className="overflow-y-auto flex-grow"
                    onScroll={handleScroll}
                    style={{ maxHeight: 'calc(100% - 60px)' }} // Adjust height to leave space for the radio button
                >
                    <h1 className="text-[#213063] font-KalamehBold py-4">تعهدنامه شرایط و مقررات استفاده از تسهیلات اقساطی</h1>
                    <p className='text-justify px-10'>
                      موضوع: تعهد دریافت کننده بیمه نامه اقساطی در خصوص پرداخت اقساط بیمه نامه در برابر اعطاکننده بیمه نامه اقساطی
             تعهدات: 
       1.دریافت کننده بیمه نامه اقساطی متعهد است اقساط را در موعد سررسید پرداخت نماید واعلام و اقرار و موافقت مینماید که  در صورت تاخیر در پرداخت هر یک از اقساط ولو به مدت یک روز  کلیه اقساط بیمه نامه حال شده. 
       2.دریافت کننده بیمه نامه اقساطی از مقررات و ضوابط داخلی اعطا کننده بیمه نامه و نوع بیمه نامه دریافتی و غیره اطلاع کامل حاصل نموده است .اعطا کننده بیمه نامه اقساطی حق دارد در تمام مواقع از هر نوع مال علی الخصوص خودرو موضوع بیمه نامه و همچنین موجودی هر نوع حساب دریافت کننده ،راسا مطالبات خود را وصول یا به طریق مقتضی استیفاء نماید و صرف اظهار اعطاکننده در خصوص اعلام مطالبات و میزان آن ، جهت وصول آن ها مستندا به این تعهدنامه کفایت میکند و نیاز به اقامه هیچگونه دلیل دیگری ندارد.
        3.دریافت کننده بیمه نامه اقساطی نمیتواند از تاریخ امضای این تعهدنامه با اشخاص حقیقی و حقوقی ثالث معاملات و قراردادهای بعمل آورد که به نحوی از انحاء مغایر و مخل شروط و مندرجات این تعهدنامه ، یا برای فرار از دین ناشی از آن باشد.در صورت امضاء و یا انعقاد چنین قراردادی ، در برابر اعطا کننده بیمه نامه به طور کلی از درجه اعتبار ساقط می باشد.
      4.دریافت کننده بیمه نامه اقساطی اذعان و اقرار مینماید در صورت عدم پرداخت اقساط بیمه ، اعطاکننده می تواند و این اختیار را دارد کلیه طلب خود را از خودرو موضوع بیمه نامه وصول کند و حق طرح دعوی ، بدوا توقیف خودرو از طریق تامین خواسته و سایر طرق ، و مراجعه به مراجع قضایی و دادگستری و اداره ثبت و بخش های اجرای احکام دادگستری  و اجراییات ثبتی و پیگیری های اجرایی، بلافاصله پس از عدم پرداخت هر یک از اقساط در سررسید مربوط به خودش را دارد.
        5.دریافت کننده تسهیلات تعهد می نماید در صورت عدم تسویه کامل هر یک از اقساط در سر رسید خود ، مبلغی بر ذمه وی بعنوان خسارت تاخیر تادیه تعلق گیرد.همچینن دریافت کننده اعلام و اقرار می نماید که هر مبلغی پس از سررسید یا معوق شدن اقساط پرداخت شود بین سه جزء اصل ، خسارت تاخیر تادیه و هزینه های قانونی کارمزد به تساوی تقسیم گردد.
        وثایق و تضمینات :
        1. دریافت کننده بیمه نامه اقساطی  متعهد میگردد یک فقره سفته الکترونیکی به میزان 120 درصد مبلغ کل اقساط به عنوان ضمانت در وجه و نام اعطا کننده بیمه نامه اقساطی صادر نماید 
       2.اعطا کننده بیمه نامه میتواند در صورت تخلف دریافت کننده از هریک از تعهدات خود ، بدون احتیاج به اقامه و ارائه هیچ گونه دلیل و مدرک دیگر ، صرفا به استناد همین تعهدنامه نسبت به سفته فوق اقدام نماید.
       4.سفته الکترونیکی صرفا پس از پرداخت آخرین قسط ، به بدهکار عودت میگردد و پرداختهایی که در اثنا مدت قرارداد بعمل می آید هیچگونه حق و ادعایی نسبت به استرداد سند ضمانت به وجود نمی آورد.
      5.دریافت کننده بیمه نامه اقساطی موافقت می نماید در صورتی که بعدا و در آینده ، معاملات دیگری میان ایشان و اعطاکننده صورت گیرد و وثائق و تضمینات جدیدی اخذ گردد ، مادام که مطالبات این تعهدنامه وصول نشده است ، تضمینات و وثائق این قرارداد به قوت و اعتبار خود باقی است.
     شرایط و آثار : 
      1.این تعهدنامه با امعان نظر بر اصل آزادی قراردادها ، مستند به ماده 10 و 190 قانون مدنی و اصل لازم بودن قراردادها منعقد شده است و نسبت به همه اشخاص لازم می باشد.اشخاص قرارداد حق هرگونه فسخ یکطرفه را از خود سلب مینمایند.
      2.کلیه خیارات ولو خیار غبن چه افحش و چه فاحش نسبت به این توافقنامه ساقط میگردد.
      3.این توافقنامه در صحت و سلامت عقلی و ذهنی و عاری از هرگونه محدودیت ها جهت انجام معاملات ، با اختیار و رضایت قلبی اشخاص منعقد شده است. 
    4.دریاقت کننده بیمه نامه اقساطی حق هر گونه اعتراض نسبت به این تعهدنامه و هریک از بندهای آن را از خود سلب و ساقط مینماید .
  مدت اعتبار : این تعهدنامه از تاریخ امضا آن تا پایان پرداخت آخرین قسط معتبر  میباشد .  
          </p>
     </div>
        <div className="flex items-center gap-6 py-4 mt-10">
                    <label className={`flex items-center cursor-pointer ${isScrollable ? 'text-[#213063]' : 'text-gray-400 cursor-not-allowed'}`}>
                        <input
                            type="checkbox"
                            className="hidden"
                            disabled={!isScrollable}
                            checked={isChecked}
                            onChange={handleRadioChange}
                        />
                        <span className={`w-5 h-5 border-2 border-[#55c7e0] rounded-full flex items-center justify-center mr-2 relative mx-1`}>
                            {isChecked && <span className="w-3 h-3 bg-[#55c7e0] rounded-full"></span>}
                        </span>
                        قوانین را خوانده‌ام و موافقم
                    </label>
                </div>
            </div>
        </div>
    );
}